backend/src/test/artillery/load-test-phase-1-heavy.yml
config:
  target: "https://localhost/api"
  tls:
    rejectUnauthorized: false
  processor: "./processor.js"
  payload:
    - path: "users.csv"
      fields:
        - "email"
        - "password"
      order: "random"
      skipHeader: true
  phases:
    - duration: 15
      arrivalRate: 2
      name: "Warm up"
    - duration: 30
      arrivalRate: 2
      name: "Sustained Heavy Load"
  variables:
    roomId: "1"

scenarios:
  - name: "Heavy Processing Flow (Search, Stats, Smart-Search, Calendar)"
    flow:
      - function: "setupDates"
      - log: "Heavy Load VU executing -> Email: {{ email }}"

      # 1. Login
      - post:
          url: "/auth/login"
          cookie:
            dummy: "1"
          json:
            username: "{{ email }}"
            password: "{{ password }}"
          expect:
            - statusCode: 200

      - think: 1

      # 2. Stats
      - get:
          url: "/stats"
          expect:
            - statusCode: 200

      # 3. Advance search (Hibernate Search - Full Text)
      - get:
          url: "/search/rooms?text=a&minCapacity=5"
          expect:
            - statusCode: 200

      - think: 1

      # 4. Smart Search (Haversine and overlapping)
      - get:
          url: "/reservations/smart-search?start={{ encodedStartDate }}&end={{ encodedEndDate }}&minCapacity=2"
          expect:
            - statusCode: 200

      # 5. Calendar
      - get:
          url: "/rooms/{{ roomId }}/calendar?start={{ encodedStartDate }}&end={{ encodedEndDate }}"
          expect:
            - statusCode: 200

      # 6. Logout
      - post:
          url: "/auth/logout"