backend/src/test/artillery/load-test-phase-3-soak.yaml
config:
  target: "http://localhost" 
  processor: "./processor-multi-room.js"
  http:
    keepAlive: true
    timeout: 5        
    pool: 20         
      
  variables:
    reason: "Soak Test"
  phases:
    - duration: 60
      arrivalRate: 2
      name: "Phase 1: Warm up"
    - duration: 7200 # 2 hours
      arrivalRate: 5
      name: "Soak test (Evaluating Memory Leaks)"

scenarios:
  - name: "Login and room search"
    weight: 70
    flow:
      - function: "setupDatesAndRooms" 
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ email }}"
            password: "{{ password }}"
      - think: 2
      - get:
          url: "/api/search/rooms?text={{searchText}}&campusId={{searchCampusId}}&minCapacity={{searchCapacity}}&active=true&page=0&size=10"
      - think: 5

  - name: "Login, consult and direct booking"
    weight: 20
    flow:
      - function: "setupDatesAndRooms"
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "jwt"
      - think: 2
      - get:
          url: "/api/search/rooms?text={{searchText}}&active=true&page=0&size=10"
      - think: 4
      - post:
          url: "/api/reservations"
          json:
            roomId: "{{ roomId }}"
            startDate: "{{ dynamicStartDate }}"
            endDate: "{{ dynamicEndDate }}"
            reason: "{{ reason }}"

  - name: "Smart Search and alternative book"
    weight: 10
    flow:
      - function: "setupDatesAndRooms"
      - post:
          url: "/api/auth/login"
          json:
            username: "{{ email }}"
            password: "{{ password }}"
      - think: 2
      - get:
          url: "/api/search/rooms?text={{searchText}}&active=true&page=0&size=10"
      - think: 4
      - get:
          url: "/api/reservations/smart-search?start={{encodedStartDate}}&end={{encodedEndDate}}"
      - think: 3
      - post:
          url: "/api/reservations"
          json:
            roomId: "{{ roomId }}"
            startDate: "{{ dynamicStartDate }}"
            endDate: "{{ dynamicEndDate }}"
            reason: "{{ reason }} - Smart Search"